aaron-bond.better-comments
anysphere.pyright
biomejs.biome
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
formulahendry.auto-rename-tag
kevinrose.vsc-python-indent
matangover.mypy
ms-playwright.playwright
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-vscode.vscode-typescript-next
njpwerner.autodocstring
pkief.material-icon-theme
shan.code-settings-sync
tal7aouy.theme
tamasfe.even-better-toml
usernamehw.errorlens
vscode-icons-team.vscode-icons
yzhang.markdown-all-in-one
